# За координатами широти і довготи двох точок на Землі у градусах визначте відстань між ними у
# кілометрах. Нехай (x1, y1) і (x2, y2) є кординатами широти і довготи (у градусах) двох точок
# на земній поверхні. Відстань між цими точками у кілометрах обчислюється так: 6371.032 ×
# arccos(sin(x1) × sin(x2) + cos(x1) × cos(x2) × cos(y1 - y2)). Значення
# 6371,032 - це середній радіус Землі у кілометрах. Тригонометричні функції Python працюють
# з радіанами. Як результат, необхідно перетворити значення координат із градусів у радіани
# перед обчисленням відстані за формулою. Модуль math містить функцію з ім’ям radians(),
# яка переводить градуси у радіани. Переведення можна зробити і за формулою, на зразок x1 =
# x1 × pi/180, де pi - число Пі. Знайдіть відстань між двома містами Пекін (39.9075000,
# 116.3972300) і Київ (50.4546600, 30.5238000) і виведіть значення на екран. Значення
# відстані повинне відображатися у відформатованому вигляді: з використанням трьох знаків
# після десяткової крапки, мінімальною довжиною поля (10), вирівнюванням за правим краєм. На
# даному сайті знайдіть значення координат у десяткових градусах ще для кількох пар міст на
# вибір і визначте відстань у кілометрах між ними. Перевірте правильність визначення відстаней
# між містами, використовуючи один із сервісів вищезгаданого сайту.

import math

def calculate_distance(city_1, city_2):
    x1, y1 = map(math.radians, city_1)
    x2, y2 = map(math.radians, city_2)

    earth_radius = 6371.032

    calculated_distance = earth_radius * math.acos(math.sin(x1) * math.sin(x2) +
                                        math.cos(x1) * math.cos(x2) * math.cos(y1 - y2))

    return f"{calculated_distance:10.3f}"

kyiv_coords = (50.4546600, 30.5238000)
beijing_coords = (39.9075000, 116.3972300)
new_york_coords = (43.000000, -75.000000)
madrid_coords = (40.416775, -3.703790)
oslo_coords = (59.911491, 10.757933)

print(calculate_distance(kyiv_coords, beijing_coords))
print(calculate_distance(kyiv_coords, new_york_coords))
print(calculate_distance(kyiv_coords, madrid_coords))
print(calculate_distance(kyiv_coords, oslo_coords))
print(calculate_distance(oslo_coords, new_york_coords))

