# Обчисліть тривалість якоїсь події. Припустимо, учнівські канікули тривали кілька днів. На
# екран треба вивести у відформатованому вигляді (вирівнювання за лівим краєм, ширина поля:
# 10 знаків) загальну тривалість цієї події у годинах, хвилинах, секундах.

number_of_days = int(input("Введіть кількість днів канікул: "))

total_hours = number_of_days * 24
total_minutes = total_hours * 60
total_seconds = total_minutes * 60

print(f"Години:   {total_hours:<10}")
print(f"Хвилини:  {total_minutes:<10}")
print(f"Секунди:  {total_seconds:<10}")