# Виведіть представлення букви, яку вводить користувач, у символах азбуки Морзе . Фрагмент
# словника має такий вигляд: morse = {&#39;A&#39;: &#39;.-&#39;, &#39;B&#39;: &#39;-...&#39;, &#39;C&#39;: &#39;-.-.&#39;, &#39;D&#39;: &#39;-
# ..&#39;, &#39;E&#39;: &#39;.&#39;, &#39;F&#39;: &#39;..-.&#39;, ...}. Передбачте у програмі обробку малих і великих букв.

morse = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..'}

letter = input("Введіть одну літеру: ").upper()
if letter in morse:
    print(f"Код Морзе для літери '{letter}': {morse[letter]}")
else:
    print("Неправильні дані. Будь ласка, введіть одну літеру латинського алфавіту від A до Z.")
