# Із словника teams необхідно вивести на екран статистику кількох команд Національної
# баскетбольної асоціації NBA. Створіть словник teams, дотримуючись наступних правил. Назви
# команд - це ключі словника. Значення у словнику - це список, на зразок: [Всього ігор, Перемог,
# Нічиїх, Поразок, Всього очок]. Значення списку - це цілі числа, які обираються довільно. При
# виведенні даних, прослідкуйте, щоб формат виведення був таким: NEW YORK KNICKS 22 7 6 9
# 45. Інформація про кожну команду має міститися в окремому рядку. Зверніть увагу на те, що дані у
# словнику є невпорядкованими.

teams = {
    'NEW YORK KNICKS': [22, 7, 6, 9, 45],
    'LOS ANGELES LAKERS': [25, 15, 3, 7, 54],
    'CHICAGO BULLS': [20, 10, 5, 5, 50],
    'MIAMI HEAT': [18, 9, 4, 5, 48],
    'BOSTON CELTICS': [23, 12, 3, 8, 51]
}

for team, data in teams.items():
    print(f"{team} {' '.join(map(str, data))}")